hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_WIFI/packages/wifi-host-driver-latest/wifi-connection-manager/include/cy_wcm.h
/*
 * (c) 2025, Infineon Technologies AG, or an affiliate of Infineon
 * Technologies AG. All rights reserved.
 * This software, associated documentation and materials ("Software") is
 * owned by Infineon Technologies AG or one of its affiliates ("Infineon")
 * and is protected by and subject to worldwide patent protection, worldwide
 * copyright laws, and international treaty provisions. Therefore, you may use
 * this Software only as provided in the license agreement accompanying the
 * software package from which you obtained this Software. If no license
 * agreement applies, then any use, reproduction, modification, translation, or
 * compilation of this Software is prohibited without the express written
 * permission of Infineon.
 *
 * Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
 * IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
 * INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
 * THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
 * SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
 * Infineon reserves the right to make changes to the Software without notice.
 * You are responsible for properly designing, programming, and testing the
 * functionality and safety of your intended application of the Software, as
 * well as complying with any legal requirements related to its use. Infineon
 * does not guarantee that the Software will be free from intrusion, data theft
 * or loss, or other breaches ("Security Breaches"), and Infineon shall have
 * no liability arising out of any Security Breaches. Unless otherwise
 * explicitly approved by Infineon, the Software may not be used in any
 * application where a failure of the Product or any consequences of the use
 * thereof can reasonably be expected to result in personal injury.
 */

/**
* @file cy_wcm.h
* @brief Wi-Fi Connection Manager (WCM) is a library that helps application developers manage their Wi-Fi connectivity.
* The library provides a set of APIs that can be used to establish and monitor Wi-Fi connections on Infineon platforms that support Wi-Fi connectivity.
* The library APIs are thread-safe. The library monitors the Wi-Fi connection and notifies the connection state change through an event notification mechanism.
* The library also provides APIs to connect to a Wi-Fi network using Wi-Fi Protected Setup (WPS) methods.
* See individual APIs for more details.
* WPS is disabled by default. WPS uses the Mbed TLS security stack. Enable the following components for WPS:
* COMPONENTS+=WPS MBEDTLS
*
* The library supports multi-core architecture by making a subset of APIs available as virtual APIs.
* The virtualization of the WCM library helps to access the WCM APIs defined in one core from the other core using Inter Process Communication (IPC).
* The WCM can now be run on two cores simultaneously, with one core containing the full connectivity stack (primary core) and the other core containing the subset of virtual-only APIs (secondary core).
* The virtual APIs pipe the API requests over IPC to the primary core where the API is actually executed and the result is passed back to the secondary core.
* This virtualization abstracts out the implementation details and complexity of IPC, thus making multi-core connectivity application development simple.
*
* The following APIs are available as virtual APIs on the secondary core:
* - cy_wcm_is_connected_to_ap
* - cy_wcm_register_event_callback
* - cy_wcm_deregister_event_callback
*
* In order to use the virtual APIs, the Virtual Connectivity Manager (VCM) library needs to be included and initialized first.
* Define the following compile-time macros in the secondary core's application:
* DEFINES+=ENABLE_MULTICORE_CONN_MW USE_VIRTUAL_API
* ENABLE_MULTICORE_CONN_MW must be defined on both applications. For more details, see the quick start guide.
*
* For more information on virtualization, see the [Virtual Connectivity Manager](https://github.com/Infineon/virtual-connectivity-manager) library.
*/


#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include "cy_result.h"
#include "cy_wcm_error.h"
#include "whd_types.h"

#if defined(__ICCARM__)
#define CYPRESS_WEAK            __WEAK
#define CYPRESS_PACKED(struct)  __packed struct
#elif defined(__GNUC__) || defined(__clang__) || defined(__CC_ARM) || defined(__llvm__)
#define CYPRESS_WEAK            __attribute__((weak))
#define CYPRESS_PACKED(struct)  struct __attribute__((packed))
#else
#define CYPRESS_WEAK           __attribute__((weak))
#define CYPRESS_PACKED(struct) struct __attribute__((packed))
#endif  /* defined(__ICCARM__) */

/**
 * \defgroup group_wcm_mscs Message sequence charts
 * \defgroup group_wcm_macros Macros
 * \defgroup group_wcm_enums Enumerated types
 * \defgroup group_wcm_typedefs Typedefs
 * \defgroup group_wcm_structures Structures
 * \defgroup group_wcm_functions Functions
 */

/**
*
* \addtogroup group_wcm_mscs
* \{
*
********************************************************************************
* \section section_wps_enrollee WPS Enrollee
********************************************************************************
*
* \image html uml_wps_enrollee.png
*
* \}
*
*/

/**
 * \addtogroup group_wcm_macros
 * \{
 */

/******************************************************
 *                    Constants
 ******************************************************/
#define CY_WCM_MAX_SSID_LEN                (32)        /**< Max SSID length.                            */
#define CY_WCM_MAX_PASSPHRASE_LEN          (63)        /**< Max passphrase length.                      */
#define CY_WCM_MIN_PASSPHRASE_LEN          (8)         /**< Min passphrase length.                      */
#define CY_WCM_MAC_ADDR_LEN                (6)         /**< MAC address length.                         */
#define CY_WCM_MAX_IE_LENGTH               (3)         /**< Maximum Length of Information Element       */
#define WEP_ENABLED                        0x0001      /**< Flag to enable WEP security.                */
#define TKIP_ENABLED                       0x0002      /**< Flag to enable TKIP encryption.             */
#define AES_ENABLED                        0x0004      /**< Flag to enable AES encryption.              */
#ifdef CERT_MULTI_AKM
/** \cond INTERNAL */
#define PSK_FBT                            0x00000001
#define SAE_FBT                            0x00000002
#define ENTERP_FBT                         0x00000004
/** \endcond */
#endif 
#define SHARED_ENABLED                     0x00008000  /**< Flag to enable shared key security.         */
#define WPA_SECURITY                       0x00200000  /**< Flag to enable WPA security.                */
#define WPA2_SECURITY                      0x00400000  /**< Flag to enable WPA2 security.               */
#ifndef COMPONENT_55900
#define WPA2_SHA256_SECURITY               0x00800000  /**< Flag to enable WPA2 SHA256 Security         */
#endif
#define WPA3_SECURITY                      0x01000000  /**< Flag to enable WPA3 PSK security.           */
#define WPA3_OWE                           0x80000000  /**< Flag to enable WPA3 OWE Security            */
#define ENTERPRISE_ENABLED                 0x02000000  /**< Flag to enable enterprise security.         */
#ifdef COMPONENT_55900
#define SHA256_1X                          0x04000000  /**< Flag 1X with SHA256 key derivation          */
#define SUITE_B_SHA384                     0x08000000  /**< Flag to enable Suite B-192 SHA384 Security  */
#endif
#define WPS_ENABLED                        0x10000000  /**< Flag to enable WPS security.                */
#define IBSS_ENABLED                       0x20000000  /**< Flag to enable IBSS mode.                   */
#define FBT_ENABLED                        0x40000000  /**< Flag to enable FBT.                         */

/** WPS password length for PIN mode. */
#define CY_WCM_WPS_PIN_LENGTH              (9)

/** Maximum number of callbacks that can be registered with the WCM library. */
#define CY_WCM_MAXIMUM_CALLBACKS_COUNT     (5)

/**
 * Setup Command field (Table 9-262k)
 */
#define CY_WCM_TWT_SETUP_CMD_REQUEST_TWT      (0u)    /**< Request TWT   */
#define CY_WCM_TWT_SETUP_CMD_SUGGEST_TWT      (1u)    /**< Suggest TWT   */
#define CY_WCM_TWT_SETUP_CMD_DEMAND_TWT       (2u)    /**< Demand TWT    */
#define CY_WCM_TWT_SETUP_CMD_GROUPING_TWT     (3u)    /**< Grouping TWT  */
#define CY_WCM_TWT_SETUP_CMD_ACCEPT_TWT       (4u)    /**< Accept TWT    */
#define CY_WCM_TWT_SETUP_CMD_ALTERNATE_TWT    (5u)    /**< Alternate TWT */
#define CY_WCM_TWT_SETUP_CMD_DICTATE_TWT      (6u)    /**< Dictate TWT   */
#define CY_WCM_TWT_SETUP_CMD_REJECT_TWT       (7u)    /**< Reject TWT    */

/**
 * Macros for TWT flow type
 */
#define CY_WCM_TWT_FLOW_TYPE_ANNOUNCED        (0)     /**< Announced TWT: Device sends a PS-Poll (Power Save-Poll) or trigger at the beginning of the TWT service period to inform the AP that it is ready to receive data. */
#define CY_WCM_TWT_FLOW_TYPE_UNANNOUNCED      (1)     /**< Un-announced TWT: The AP can start transmitting data to the device within the TWT service period without first receiving a frame/trigger from the device. */
/**
 * Macros for TWT flow ID
 */
#define CY_WCM_TWT_FLOW_ID_ALL                (0xff)  /**< Special flow ID to target all TWT sessions. */

/** \} group_wcm_macros */

/**
 * \addtogroup group_wcm_enums
 * \{
 */

/******************************************************
 *            Enumerations
 ******************************************************/

/**
 * IP Version
 */
typedef enum
{
    CY_WCM_IP_VER_V4 = 4,      /**< Denotes IPv4 version. */
    CY_WCM_IP_VER_V6 = 6       /**< Denotes IPv6 version. */
} cy_wcm_ip_version_t;

/**
 * IPV6 types
 */
typedef enum
{
    CY_WCM_IPV6_LINK_LOCAL = 0,  /**< Denotes IPv6 link-local address type. */
    CY_WCM_IPV6_GLOBAL           /**< Denotes IPv6 global address type. */
} cy_wcm_ipv6_type_t;

/**
 * Enumeration of Wi-Fi Security Modes
 */
typedef enum
{
    CY_WCM_SECURITY_OPEN                = 0,                                                                   /**< Open security.                                         */
    CY_WCM_SECURITY_WEP_PSK             = WEP_ENABLED,                                                         /**< WEP PSK security with open authentication.             */
    CY_WCM_SECURITY_WEP_SHARED          = ( WEP_ENABLED   | SHARED_ENABLED ),                                  /**< WEP PSK security with shared authentication.           */
    CY_WCM_SECURITY_WPA_TKIP_PSK        = ( WPA_SECURITY  | TKIP_ENABLED ),                                    /**< WPA PSK security with TKIP.                            */
    CY_WCM_SECURITY_WPA_AES_PSK         = ( WPA_SECURITY  | AES_ENABLED ),                                     /**< WPA PSK security with AES.                             */
    CY_WCM_SECURITY_WPA_MIXED_PSK       = ( WPA_SECURITY  | AES_ENABLED | TKIP_ENABLED ),                      /**< WPA PSK security with AES and TKIP.                    */
    CY_WCM_SECURITY_WPA2_AES_PSK        = ( WPA2_SECURITY | AES_ENABLED ),                                     /**< WPA2 PSK security with AES.                            */
#ifndef COMPONENT_55900
    CY_WCM_SECURITY_WPA2_AES_PSK_SHA256 = ( WPA2_SECURITY | WPA2_SHA256_SECURITY | AES_ENABLED ),              /**< WPA2 PSK SHA256 Security with AES                      */
#else
    CY_WCM_SECURITY_WPA2_AES_PSK_SHA256 = ( WPA2_SECURITY | SHA256_1X | AES_ENABLED ),                         /**< WPA2 PSK SHA256 Security with AES                      */
#endif
    CY_WCM_SECURITY_WPA2_TKIP_PSK       = ( WPA2_SECURITY | TKIP_ENABLED ),                                    /**< WPA2 PSK security with TKIP.                           */
    CY_WCM_SECURITY_WPA2_MIXED_PSK      = ( WPA2_SECURITY | AES_ENABLED | TKIP_ENABLED ),                      /**< WPA2 PSK security with AES and TKIP.                   */
    CY_WCM_SECURITY_WPA2_FBT_PSK        = ( WPA2_SECURITY | AES_ENABLED | FBT_ENABLED),                        /**< WPA2 FBT PSK security with AES and TKIP.               */
    CY_WCM_SECURITY_WPA3_SAE            = ( WPA3_SECURITY | AES_ENABLED ),                                     /**< WPA3 security with AES.                                */
    CY_WCM_SECURITY_WPA2_WPA_AES_PSK    = (WPA2_SECURITY | WPA_SECURITY | AES_ENABLED),                        /**< WPA2 WPA PSK Security with AES                         */
    CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK  = (WPA2_SECURITY | WPA_SECURITY | AES_ENABLED | TKIP_ENABLED),         /**< WPA2 WPA PSK Security with AES & TKIP.                 */
    CY_WCM_SECURITY_WPA3_WPA2_PSK       = ( WPA3_SECURITY | WPA2_SECURITY | AES_ENABLED ),                     /**< WPA3 WPA2 PSK security with AES.                       */
    CY_WCM_SECURITY_WPA_TKIP_ENT        = (ENTERPRISE_ENABLED | WPA_SECURITY | TKIP_ENABLED),                  /**< WPA Enterprise Security with TKIP.                     */
    CY_WCM_SECURITY_WPA_AES_ENT         = (ENTERPRISE_ENABLED | WPA_SECURITY | AES_ENABLED),                   /**< WPA Enterprise Security with AES                       */
    CY_WCM_SECURITY_WPA_MIXED_ENT       = (ENTERPRISE_ENABLED | WPA_SECURITY | AES_ENABLED | TKIP_ENABLED),    /**< WPA Enterprise Security with AES and TKIP.             */
    CY_WCM_SECURITY_WPA2_TKIP_ENT       = (ENTERPRISE_ENABLED | WPA2_SECURITY | TKIP_ENABLED),                 /**< WPA2 Enterprise Security with TKIP.                    */
    CY_WCM_SECURITY_WPA2_AES_ENT        = (ENTERPRISE_ENABLED | WPA2_SECURITY | AES_ENABLED),                  /**< WPA2 Enterprise Security with AES.                     */
    CY_WCM_SECURITY_WPA2_MIXED_ENT      = (ENTERPRISE_ENABLED | WPA2_SECURITY | AES_ENABLED | TKIP_ENABLED),   /**< WPA2 Enterprise Security with AES and TKIP.            */
    CY_WCM_SECURITY_WPA2_FBT_ENT        = (ENTERPRISE_ENABLED | WPA2_SECURITY | AES_ENABLED | FBT_ENABLED),    /**< WPA2 Enterprise Security with AES and FBT.             */
#if defined(COMPONENT_55900) || defined(COMPONENT_PSE84)
    CY_WCM_SECURITY_WPA3_192BIT_ENT     = (ENTERPRISE_ENABLED | WPA3_SECURITY | SUITE_B_SHA384 | AES_ENABLED), /**< WPA3 192-BIT Enterprise Security with AES              */
    CY_WCM_SECURITY_WPA3_ENT            = (ENTERPRISE_ENABLED | WPA3_SECURITY | SHA256_1X | AES_ENABLED),      /**< WPA3 Enterprise only with AES GCM-256                  */
    CY_WCM_SECURITY_WPA3_ENT_AES_CCMP   = (ENTERPRISE_ENABLED | WPA3_SECURITY | WPA2_SECURITY | SHA256_1X | AES_ENABLED), /**< WPA3 Enterprise Transition with AES CCM-128 */
#endif
    CY_WCM_SECURITY_IBSS_OPEN           = ( IBSS_ENABLED ),                                                    /**< Open security on IBSS ad hoc network.                  */
    CY_WCM_SECURITY_WPS_SECURE          = ( WPS_ENABLED | AES_ENABLED),                                        /**< WPS with AES security.                                 */
#ifdef COMPONENT_WIFI6
    CY_WCM_SECURITY_OWE                 = ( WPA3_OWE | AES_ENABLED ),                                          /**< Enhanced open with AES security                        */
    CY_WCM_SECURITY_WPA3_FBT            = (WPA3_SECURITY | AES_ENABLED | FBT_ENABLED),                         /**< WPA3 Security with FBT                                 */
    CY_WCM_SECURITY_WPA3_WPA2_PSK_FBT   = (WPA3_SECURITY | WPA2_SECURITY | AES_ENABLED | FBT_ENABLED),         /**< WPA3 WPA2 PSK security with AES FT enabled.            */
#endif

